supersonic/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cell;

setFormat       raw;

writeControl    writeTime; // this ensures that it's writing only at writeInterval

sets
(

    // make sure to change (x1 y1 z1) and (x2 y2 z2) to
    // the coordinates of the start and end points

    initialHorizontal 
    {
        type    lineCell;
        axis    xyz;
        start   (-1 1e-5 0);
        end     (1 1e-5 0);
    }
    stepVertical 
    {
        type    lineCell;
        axis    xyz;
        start   (0.59995 -0.1 0);
        end     (0.59995 0.20005 0);
    }
    stepHorizontal 
    {
        type    lineCell;
        axis    xyz;
        start   (0.59995 0.20005 0);
        end     (3.1 0.20005 0);
    }
    topWall
    {
        type    lineCell;
        axis    xyz;
        start   (-1 0.99995 0);
        end     (4 0.99995 0);
    }
);

fields          ( p U );


// ************************************************************************* //
